In [ ]:
"""Pandas."""

In [ ]:
# # Способ 2. Подключение к базе данных SQL
# # импортируем модуль sqlite3 для работы с базой данных SQL
# import sqlite3 as sql

# # Способ 3. Создание датафрейма из словаря
# import numpy as np

# # создадим пустой словарь
# # Создание датафрейма
# # Способ 1. Создание датафрейма из файла
# import pandas as pd

# # испортируем файл из папки content и выведем первые три строки
# csv_zip = pd.read_csv("/content/train.zip")
# csv_zip.head(3)

In [ ]:
# # импортируем данные в формате Excel, указав номер листа, который хотим использовать
# excel_data = pd.read_excel("/content/iris.xlsx", sheet_name=0)
# excel_data.head(3)

In [ ]:
# # передадим соответствующую ссылку в функцию pd.read_html()
# # в параметре match укажем ключевые слова, которые помогут найти нужную таблицу
# html_data = pd.read_html(
#     "https://en.wikipedia.org/wiki/World_population", match="World population"
# )
# # мы получили пять результатов
# len(html_data)

In [ ]:
# # создадим соединение с базой данных chinook
# conn = sql.connect("/content/chinook.db")

# # выберем все строки из таблицы tracks
# sql_data = pd.read_sql("SELECT * FROM tracks", conn)  # vs. read_sql_query

# # посмотрим на результат
# sql_data.head(3)

In [2]:
# # создадим несколько списков и массивов Numpy с информацией о семи странах мира
# country = np.array(
#     [
#         "China",
#         "Vietnam",
#         "United Kingdom",
#         "Russia",
#         "Argentina",
#         "Bolivia",
#         "South Africa",
#     ]
# )
# capital = ["Beijing", "Hanoi", "London", "Moscow", "Buenos Aires", "Sucre", "Pretoria"]
# population = [1400, 97, 67, 144, 45, 12, 59]  # млн. человек
# area = [9.6, 0.3, 0.2, 17.1, 2.8, 1.1, 1.2]  # млн. кв. км.
# sea = [1] * 5 + [0, 1]  # выход к морю (в этом списке его нет только у Боливии)

In [5]:
# countries_dict = {}
# # превратим эти списки в значения словаря,
# # одновременно снабдив необходимыми ключами
# countries_dict["country"] = country
# countries_dict["capital"] = capital
# countries_dict["popilation"] = population
# countries_dict["area"] = area
# countries_dict["sea"] = sea
# countries = pd.DataFrame(countries_dict)

In [6]:
# # Способ 4. Создание датафрейма из 2D массива Numpy
# # внешнее измерение будет столбцами, внутренее - строками
# arr = np.array([[1, 1, 1], [2, 2, 2], [3, 3, 3]])

# pd.DataFrame(arr)

   0  1  2
0  1  1  1
1  2  2  2
2  3  3  3

In [8]:
# countries.columns

Index(['country', 'capital', 'popilation', 'area', 'sea'], dtype='object')

In [9]:
# countries.index

RangeIndex(start=0, stop=7, step=1)

In [10]:
# countries.values

array([['China', 'Beijing', 1400, 9.6, 1],
       ['Vietnam', 'Hanoi', 97, 0.3, 1],
       ['United Kingdom', 'London', 67, 0.2, 1],
       ['Russia', 'Moscow', 144, 17.1, 1],
       ['Argentina', 'Buenos Aires', 45, 2.8, 1],
       ['Bolivia', 'Sucre', 12, 1.1, 0],
       ['South Africa', 'Pretoria', 59, 1.2, 1]], dtype=object)

In [11]:
# countries.axes[0]

RangeIndex(start=0, stop=7, step=1)

In [12]:
# countries.ndim, countries.shape, countries.size

(2, (7, 5), 35)

In [13]:
# countries.dtypes

country        object
capital        object
popilation      int64
area          float64
sea             int64
dtype: object

In [14]:
# countries.memory_usage()

Index         132
country        56
capital        56
popilation     56
area           56
sea            56
dtype: int64

In [16]:
# # Индекс датафрейма
# # создадим список с кодами стран
# custom_index = ["CN", "VN", "GB", "RU", "AR", "BO", "ZA"]

# countries = pd.DataFrame(countries_dict, index=custom_index)
# countries

           country       capital  popilation  area  sea
CN           China       Beijing        1400   9.6    1
VN         Vietnam         Hanoi          97   0.3    1
GB  United Kingdom        London          67   0.2    1
RU          Russia        Moscow         144  17.1    1
AR       Argentina  Buenos Aires          45   2.8    1
BO         Bolivia         Sucre          12   1.1    0
ZA    South Africa      Pretoria          59   1.2    1

In [17]:
# # при этом параметр inplace = True сделает изменения постоянными
# countries.reset_index(inplace=True)
# countries

  index         country       capital  popilation  area  sea
0    CN           China       Beijing        1400   9.6    1
1    VN         Vietnam         Hanoi          97   0.3    1
2    GB  United Kingdom        London          67   0.2    1
3    RU          Russia        Moscow         144  17.1    1
4    AR       Argentina  Buenos Aires          45   2.8    1
5    BO         Bolivia         Sucre          12   1.1    0
6    ZA    South Africa      Pretoria          59   1.2    1

In [18]:
# # передадим методу название столбца, который хотим сделать индексом
# countries.set_index("index", inplace=True)
# countries

              country       capital  popilation  area  sea
index
CN              China       Beijing        1400   9.6    1
VN            Vietnam         Hanoi          97   0.3    1
GB     United Kingdom        London          67   0.2    1
RU             Russia        Moscow         144  17.1    1
AR          Argentina  Buenos Aires          45   2.8    1
BO            Bolivia         Sucre          12   1.1    0
ZA       South Africa      Pretoria          59   1.2    1

In [19]:
# countries.reset_index(drop=True, inplace=True)
# countries

          country       capital  popilation  area  sea
0           China       Beijing        1400   9.6    1
1         Vietnam         Hanoi          97   0.3    1
2  United Kingdom        London          67   0.2    1
3          Russia        Moscow         144  17.1    1
4       Argentina  Buenos Aires          45   2.8    1
5         Bolivia         Sucre          12   1.1    0
6    South Africa      Pretoria          59   1.2    1

In [20]:
# countries.index = custom_index
# countries

           country       capital  popilation  area  sea
CN           China       Beijing        1400   9.6    1
VN         Vietnam         Hanoi          97   0.3    1
GB  United Kingdom        London          67   0.2    1
RU          Russia        Moscow         144  17.1    1
AR       Argentina  Buenos Aires          45   2.8    1
BO         Bolivia         Sucre          12   1.1    0
ZA    South Africa      Pretoria          59   1.2    1

In [21]:
# # Многоуровневый индекс
# # создадим список из кортежей с названием континента и кодом страны
# rows = [
#     ("Asia", "CN"),
#     ("Asia", "VN"),
#     ("Europe", "GB"),
#     ("Europe", "RU"),
#     ("S. America", "AR"),
#     ("S. America", "BO"),
#     ("Africa", "ZA"),
# ]

In [22]:
# # в столбцах название страны и столицы мы объединим в категорию names
# # а размер населения, площадь и выход к морю в data
# cols = [
#     ("names", "country"),
#     ("names", "capital"),
#     ("data", "population"),
#     ("data", "area"),
#     ("data", "sea"),
# ]

In [23]:
# # создадим многоуровневый индекс для строк
# # индексам присвоим названия через names = ['region', 'code']
# custom_multindex = pd.MultiIndex.from_tuples(rows, names=["region", "code"])

# # сделаем то же самое для столбцов
# custom_multicols = pd.MultiIndex.from_tuples(cols)

In [24]:
# countries.index = custom_multindex
# countries.columns = custom_multicols

# countries

                          names                     data
                        country       capital population  area sea
region     code
Asia       CN             China       Beijing       1400   9.6   1
           VN           Vietnam         Hanoi         97   0.3   1
Europe     GB    United Kingdom        London         67   0.2   1
           RU            Russia        Moscow        144  17.1   1
S. America AR         Argentina  Buenos Aires         45   2.8   1
           BO           Bolivia         Sucre         12   1.1   0
Africa     ZA      South Africa      Pretoria         59   1.2   1

In [25]:
# # вернемся к обычному индексу и названиям столбцов
# custom_cols = ["country", "capital", "population", "area", "sea"]

# countries.index = custom_index
# countries.columns = custom_cols

# countries

           country       capital  population  area  sea
CN           China       Beijing        1400   9.6    1
VN         Vietnam         Hanoi          97   0.3    1
GB  United Kingdom        London          67   0.2    1
RU          Russia        Moscow         144  17.1    1
AR       Argentina  Buenos Aires          45   2.8    1
BO         Bolivia         Sucre          12   1.1    0
ZA    South Africa      Pretoria          59   1.2    1

In [26]:
# # Преобразование в другие форматы
# print(countries.to_dict())

{'country': {'CN': 'China', 'VN': 'Vietnam', 'GB': 'United Kingdom', 'RU': 'Russia', 'AR': 'Argentina', 'BO': 'Bolivia', 'ZA': 'South Africa'}, 'capital': {'CN': 'Beijing', 'VN': 'Hanoi', 'GB': 'London', 'RU': 'Moscow', 'AR': 'Buenos Aires', 'BO': 'Sucre', 'ZA': 'Pretoria'}, 'population': {'CN': 1400, 'VN': 97, 'GB': 67, 'RU': 144, 'AR': 45, 'BO': 12, 'ZA': 59}, 'area': {'CN': 9.6, 'VN': 0.3, 'GB': 0.2, 'RU': 17.1, 'AR': 2.8, 'BO': 1.1, 'ZA': 1.2}, 'sea': {'CN': 1, 'VN': 1, 'GB': 1, 'RU': 1, 'AR': 1, 'BO': 0, 'ZA': 1}}

In [27]:
# countries.to_numpy()

array([['China', 'Beijing', 1400, 9.6, 1],
       ['Vietnam', 'Hanoi', 97, 0.3, 1],
       ['United Kingdom', 'London', 67, 0.2, 1],
       ['Russia', 'Moscow', 144, 17.1, 1],
       ['Argentina', 'Buenos Aires', 45, 2.8, 1],
       ['Bolivia', 'Sucre', 12, 1.1, 0],
       ['South Africa', 'Pretoria', 59, 1.2, 1]], dtype=object)

In [28]:
# # Создание Series
# country_list = [
#     "China",
#     "South Africa",
#     "United Kingdom",
#     "Russia",
#     "Argentina",
#     "Vietnam",
#     "Australia",
# ]

In [29]:
# country_series = pd.Series(country_list)
# country_series

0             China
1      South Africa
2    United Kingdom
3            Russia
4         Argentina
5           Vietnam
6         Australia
dtype: object

In [30]:
# # Создание Series из словаря
# country_dict = {
#     "CN": "China",
#     "ZA": "South Africa",
#     "GB": "United Kingdom",
#     "RU": "Russia",
#     "AR": "Argentina",
#     "VN": "Vietnam",
#     "AU": "Australia",
# }

# country_Series = pd.Series(country_dict)
# country_Series

CN             China
ZA      South Africa
GB    United Kingdom
RU            Russia
AR         Argentina
VN           Vietnam
AU         Australia
dtype: object

In [31]:
# # Доступ к строкам, столбцам и элементам
# for column in countries:
#     print(column)

country
capital
population
area
sea

In [32]:
# # прервем цикл после первой итерации с помощью break
# for index, row in countries.iterrows():
#     print(index)
#     print(row)

CN
country         China
capital       Beijing
population       1400
area              9.6
sea                 1
Name: CN, dtype: object
VN
country       Vietnam
capital         Hanoi
population         97
area              0.3
sea                 1
Name: VN, dtype: object
GB
country       United Kingdom
capital               London
population                67
area                     0.2
sea                        1
Name: GB, dtype: object
RU
country       Russia
capital       Moscow
population       144
area            17.1
sea                1
Name: RU, dtype: object
AR
country          Argentina
capital       Buenos Aires
population              45
area                   2.8
sea                      1
Name: AR, dtype: object
BO
country       Bolivia
capital         Sucre
population         12
area              1.1
sea                 0
Name: BO, dtype: object
ZA
country       South Africa
capital           Pretoria
population              59
area                   1.2
sea                      1
Name: ZA, dtype: object

In [33]:
# for _, row in countries.iterrows():
#     # например, сформируем вот такое предложение
#     print(row["capital"] + " is the capital of " + row["country"])
#     break

Beijing is the capital of China

In [34]:
# # Доступ к столбцам

# # выведем столбец capital датафрейма countries
# countries["capital"]

CN         Beijing
VN           Hanoi
GB          London
RU          Moscow
AR    Buenos Aires
BO           Sucre
ZA        Pretoria
Name: capital, dtype: object

In [35]:
# # однако в этом случае название не должно содержать пробелов
# countries.capital

CN         Beijing
VN           Hanoi
GB          London
RU          Moscow
AR    Buenos Aires
BO           Sucre
ZA        Pretoria
Name: capital, dtype: object

In [36]:
# countries[["capital", "area"]]

         capital  area
CN       Beijing   9.6
VN         Hanoi   0.3
GB        London   0.2
RU        Moscow  17.1
AR  Buenos Aires   2.8
BO         Sucre   1.1
ZA      Pretoria   1.2

In [37]:
# countries.filter(items=["capital", "population"])

         capital  population
CN       Beijing        1400
VN         Hanoi          97
GB        London          67
RU        Moscow         144
AR  Buenos Aires          45
BO         Sucre          12
ZA      Pretoria          59

In [38]:
# # Доступ к строкам
# # выведем строки со второй по пятую (не включительно)
# countries[1:5]

           country       capital  population  area  sea
VN         Vietnam         Hanoi          97   0.3    1
GB  United Kingdom        London          67   0.2    1
RU          Russia        Moscow         144  17.1    1
AR       Argentina  Buenos Aires          45   2.8    1

In [39]:
# # Методы .loc[] и .iloc[]
# # для этого передадим методу .loc[] два списка:
# # с индексами строк и названиями столбцов
# countries.loc[["CN", "RU", "VN"], ["capital", "population", "area"]]

    capital  population  area
CN  Beijing        1400   9.6
RU   Moscow         144  17.1
VN    Hanoi          97   0.3

In [40]:
# # например, выведем все строки датафрейма
# countries.loc[:, ["capital", "population", "area"]]

         capital  population  area
CN       Beijing        1400   9.6
VN         Hanoi          97   0.3
GB        London          67   0.2
RU        Moscow         144  17.1
AR  Buenos Aires          45   2.8
BO         Sucre          12   1.1
ZA      Pretoria          59   1.2

In [41]:
# # Метод .loc[] также поддерживает значения Boolean.
# # например, выведем все строки и только последний столбец,
# # передав список соответствующих логических значений
# countries.loc[:, [False, False, False, False, True]]

    sea
CN    1
VN    1
GB    1
RU    1
AR    1
BO    0
ZA    1

In [42]:
# позволяет узнать порядковый номер
# (начиная с нуля) строки или столбца
# по их индексу и названию соответственно.
# # выведем номер строки с индексом RU
# countries.index.get_loc("RU")

3

In [43]:
# # теперь в списки мы передаем номера строк и столбцов,
# # нумерация начинается с нуля
# countries.iloc[[0, 3, 5], [0, 1, 2]]

    country  capital  population
CN    China  Beijing        1400
RU   Russia   Moscow         144
BO  Bolivia    Sucre          12

In [44]:
# countries.iloc[:3, -2:]

    area  sea
CN   9.6    1
VN   0.3    1
GB   0.2    1

In [47]:
# countries[["population", "area"]].iloc[[0, 3]]

    population  area
CN        1400   9.6
RU         144  17.1

In [48]:
# # Многоуровневый индекс и методы .loc[] и .iloc[]
# # вновь создадим датафрейм с многоуровневым индексом по строкам и столбцам
# countries.index = custom_multindex
# countries.columns = custom_multicols

# countries

                          names                     data
                        country       capital population  area sea
region     code
Asia       CN             China       Beijing       1400   9.6   1
           VN           Vietnam         Hanoi         97   0.3   1
Europe     GB    United Kingdom        London         67   0.2   1
           RU            Russia        Moscow        144  17.1   1
S. America AR         Argentina  Buenos Aires         45   2.8   1
           BO           Bolivia         Sucre         12   1.1   0
Africa     ZA      South Africa      Pretoria         59   1.2   1

In [49]:
# countries.loc["Asia", "CN"]

names  country         China
       capital       Beijing
data   population       1400
       area              9.6
       sea                 1
Name: (Asia, CN), dtype: object

In [50]:
# # выведем первую строку и столбцы с числовыми данными
# countries.loc[
#     ("Asia", "CN"), [("data", "population"), ("data", "area"), ("data", "sea")]
# ]

data  population    1400.0
      area             9.6
      sea              1.0
Name: (Asia, CN), dtype: float64

In [51]:
# # например, выведем только азиатские страны
# countries.loc[("Asia", ["CN", "VN"]), :]

               names                data
             country  capital population area sea
region code
Asia   CN      China  Beijing       1400  9.6   1
       VN    Vietnam    Hanoi         97  0.3   1

In [52]:
# # Метод .xs()
# # выберем Европу из уровня region
# # axis = 0 указывает, что мы берем строки
# countries.xs("Europe", level="region", axis=0)

               names               data
             country capital population  area sea
code
GB    United Kingdom  London         67   0.2   1
RU            Russia  Moscow        144  17.1   1

In [53]:
# # levels указывает, на каких уровнях искать названия столбцов
# # параметр axis = 1 говорит о том, что мы имеем дело со столбцами
# countries.xs(("names", "country"), level=[0, 1], axis=1)

                          names
                        country
region     code
Asia       CN             China
           VN           Vietnam
Europe     GB    United Kingdom
           RU            Russia
S. America AR         Argentina
           BO           Bolivia
Africa     ZA      South Africa

In [54]:
# # обновим атрибуты index и columns
# countries.index = custom_index
# countries.columns = custom_cols

# # посмотрим на исходный датафрейм
# countries

           country       capital  population  area  sea
CN           China       Beijing        1400   9.6    1
VN         Vietnam         Hanoi          97   0.3    1
GB  United Kingdom        London          67   0.2    1
RU          Russia        Moscow         144  17.1    1
AR       Argentina  Buenos Aires          45   2.8    1
BO         Bolivia         Sucre          12   1.1    0
ZA    South Africa      Pretoria          59   1.2    1

In [55]:
# # Метод .at[]
# countries.at["CN", "capital"]

'Beijing'

In [56]:
# # создадим логическую маску для стран с населением больше миллиарда человек
# countries.population > 1000

CN     True
VN    False
GB    False
RU    False
AR    False
BO    False
ZA    False
Name: population, dtype: bool

In [57]:
# # применим логическую маску к исходному датафрейму
# countries[countries.population > 1000]

   country  capital  population  area  sea
CN   China  Beijing        1400   9.6    1

In [58]:
# # отфильтруем датафрейм по критериям численности населения и площади
# countries[(countries.population > 50) & (countries.area < 2)]

           country   capital  population  area  sea
VN         Vietnam     Hanoi          97   0.3    1
GB  United Kingdom    London          67   0.2    1
ZA    South Africa  Pretoria          59   1.2    1

In [59]:
# # Метод .query() позволяет задавать условие фильтрации «своими словами».
# # например, выберем страны с населением более 50 млн. человек И
# # площадью менее двух млн. кв. километров
# countries.query("population > 50 and area < 2")

           country   capital  population  area  sea
VN         Vietnam     Hanoi          97   0.3    1
GB  United Kingdom    London          67   0.2    1
ZA    South Africa  Pretoria          59   1.2    1